[

  {
  "title": "BITBOX now has TypeScript support",
  "excerpt": "Unit testing and statically typed programming languages can help reduce the number of errors and bugs when writing software, and this can be especially important when building cryptocurrency related applications. In this article we demonstrate how to get started with TypeScript using the BITBOX scaffolding tool for Node.js. To enable TypeScript some minor modifications to the generated code are required, each shown in this article. All of the code used in this tutorial can be found <a href='https://github.com/Bitcoin-com/bitbox-ts-example'>on github",
  "href": "tutorials/bitbox-typescript-support.html"
  },

  {
  "title": "Memopress",
  "excerpt": "Memo and BlockPress are two very popular on-chain social networks. They use a clever OP_RETURN prefixed protocol to write your actions to the blockchain. Later clients can read that data from the chain and recreate your account’s actions. This represents a truly decentralized and censorship resistant social network and it’s only possible on Bitcoin Cash.",
  "href": "tutorials/memopress.html"
  },

  {
  "title": "Address UTXO",
  "excerpt": "Sending transactions is at the heart of BCH. BITBOX has been able to send transactions for a while but w/ BITBOX Cloud and REST taking shape we wanted to revisit the steps for sending transactions to show how to best leverage the new functionality.",
  "href": "tutorials/address-utxo.html"
  },

  {
  "title": "BIP21",
  "excerpt": "Bitcoin Cash is all about sending and receiving payments. BIP21 describes a way to encode payment request information such as address, amount, message etc as a URI. These URIs are a very popular way to share payment requests and you’ll often see them as links in a website or as QR codes. Today we’re releasing encodeBIP21 and decodeBIP21 to make it easy for your app to encode/decode BIP21 $BCH URIs.",
  "href": "tutorials/bip21.html"
  },

  {
  "title": "Mnemonic Word Lists",
  "excerpt": "Bitcoin Cash is meant for people all over EARTH. Most of those people don’t speak english. That’s why today we’re releasing wordLists so you can generate mnemonics in 8 different languages to help spread $BCH to people all over the planet.",
  "href": "tutorials/mnemonic-word-lists.html"
  },

  {
  "title": "Extended Public Keys",
  "excerpt": "Bitcoin Cash offers an unimaginably large number of addresses. This allows you to use a new address for every transaction which greatly increases your privacy. However most people keep their private keys offline in a hardware or paper wallet so it’s not conventient to generate new addresses for each transaction. Extended public keys (xpub) let you share or deploy only your xpub and applications can produce an infinite number of public keys and $BCH addresses, but can’t spend any of the $BCH sent to those addresses.",
  "href": "tutorials/extended-public-keys.html"
  },

  {
  "title": "Utilities part 2",
  "excerpt": "HD Wallets are at the heart of most Bitcoin Cash apps. Being able to quickly create them can let developers create more exciting $BCH apps quicker than ever. Today we’re releasing 7 new utility methods to let you quickly generate mnemonics, root seeds, master private keys, HD wallets and then to sign and verify messages w/ keys from that wallet.",
  "href": "tutorials/utilities-part-2.html"
  },

  {
  "title": "Paper Wallet Generator",
  "excerpt": "Paper wallets let you print public and private keys as QR codes on to a piece of paper which can be stored offline. They are a very quick and convenient way to store coins safely (as long as the paper doesn’t degrade) and are much cheaper than a hardware wallet while maintaining much of the security",
  "href": "tutorials/paper-wallet-generator.html"
  },

  {
  "title": "Utilities part 1",
  "excerpt": "bitbox-cli recently added 3 new Objects full of utility methods to help you accelerate your $BCH workflow. The BitcoinCash methods convert between satoshis and whole units.",
  "href": "tutorials/utilities-part-1.html"
  },

  {
  "title": "BITBOX Scaffolds",
  "excerpt": "The goal of BITBOX is to accelerate how quickly $BCH devs can create their apps. W/ that in mind today we’re launching Scaffolds. This is a way to bootstrap a Bitcoin Cash application in under a minute.",
  "href": "tutorials/bitbox-scaffolds.html"
  },

  {
  "title": "Multiple Environments",
  "excerpt": "Imagine you have a $BCH app which you’d like to deploy. However before doing that it seems like you should test it. BITBOX console lets you quickly switch between sending commands to your local instance or your full node running on the cloud. That way you can test your code locally before deploying to a remote server w/ production running $BCH node.",
  "href": "tutorials/multiple-environments.html"
  },

  {
  "title": "bitbox-cli",
  "excerpt": "BITBOX aims to be the go-to toolset for $BCH developers. We want you to be able to run your code and tests against your BITBOX before deploying to live environments and aim for 100% Bitcoin Cash JSON RPC API coverage.",
  "href": "tutorials/bitbox-cli.html"
  },

  {
  "title": "Sign & Verify",
  "excerpt": "BITBOX enables you to cryptographically prove ownership of an address via signing messages. You can also verify that ownership of an address from another person.",
  "href": "tutorials/sign-and-verify.html"
  },

  {
  "title": "Address Conversion",
  "excerpt": "When Bitcoin Cash began as a fork of $BTC on Aug 1st 2017 it kept the legacy address format. This ended up causing quite a bit of confusion and resulted in lost funds as users accidentially sent $BCH to $BTC addresses and vice versa.",
  "href": "tutorials/address-conversion.html"
  },

  {
  "title": "Account Creation",
  "excerpt": "Bitcoin Cash wallets are really just collections of key pairs. Hiearchical Deterministic wallets are the state of the art for reliably creating and backing up collections of related keypairs. For more detail read Andreas’s in depth explation about how they work in Mastering Bitcoin Cash.",
  "href": "tutorials/account-creation.html"
  },

  {
  "title": "Hello World",
  "excerpt": "The Bitcoin Cash ecosystem is growing quickly. People all over the EARTH are being drawn to the compelling original vision of frictionless and borderless money facilitated by on-chain scaling. The goal of BITBOX is to build a suite of tools which help accelerate the quality and quanity of applications built on top of the $BCH platform.",
  "href": "tutorials/hello-world.html"
  }

]
